### 판다스
- 결측치
- 이상치

#### 결측치
- 데이터셋 내에 값이 비어 있거나 누락된 항목을 의미
- 보통 NaN, Nano, Null 등으로 표기
- 데이터 수집 과정의 오류, 입력 미비, 응답 누락 등 여러 원인으로 발생

In [123]:
import pandas as pd
data = [['김민재', 27, 75, 5428000],
        ['이강인', 22, 57, None],
        ['박찬호', 50, None, 8428000],
        ['차범근', 70, 80, 4428000],
        ['추신수', 43, 100, 4528000],
        ['손흥민', 31, 72, 7028000],
        ['황희찬', 28, 69, 2528000]]
df = pd.DataFrame(data, columns=['성명', '나이', '몸무게', '급여'])
df

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

### 결측치 여부
isna() == isnull()

In [124]:
df.isna()

      성명     나이    몸무게     급여
0  False  False  False  False
1  False  False  False   True
2  False  False   True  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False
6  False  False  False  False

In [125]:
df.isnull()

      성명     나이    몸무게     급여
0  False  False  False  False
1  False  False  False   True
2  False  False   True  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False
6  False  False  False  False

In [126]:
df.shape

(7, 4)

In [127]:
# 비결측치의 갯수
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   성명      7 non-null      object
 1   나이      7 non-null      int64
 2   몸무게     6 non-null      float64
 3   급여      6 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 352.0+ bytes

In [128]:
# 결측치의 갯수
df.isna().sum()

성명     0
나이     0
몸무게    1
급여     1
dtype: int64

In [129]:
df['몸무게'].isna()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
Name: 몸무게, dtype: bool

In [130]:
df[df['몸무게'].isna()]

    성명  나이  몸무게         급여
2  박찬호  50  NaN  8428000.0

In [131]:
df[df['급여'].isna()]

    성명  나이   몸무게  급여
1  이강인  22  57.0 NaN

In [132]:
df[df['몸무게'].isna() | df['급여'].isna()][['성명']]

    성명
1  이강인
2  박찬호

In [133]:
df['성명'][df['몸무게'].isna()]

2    박찬호
Name: 성명, dtype: object

In [134]:
df[df['몸무게'].isna()][['성명']]

    성명
2  박찬호

In [135]:
df.loc[df['몸무게'].isna(),['성명']]

    성명
2  박찬호

In [136]:
df.loc[df['몸무게'].isna()]

    성명  나이  몸무게         급여
2  박찬호  50  NaN  8428000.0

### 결측치 없는 행 여부
notna(), notnull()

In [137]:
df.notna()
df.notnull()

     성명    나이    몸무게     급여
0  True  True   True   True
1  True  True   True  False
2  True  True  False   True
3  True  True   True   True
4  True  True   True   True
5  True  True   True   True
6  True  True   True   True

In [138]:
df[df['몸무게'].notna() & df['급여'].notna()]

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

### 결측치 제거
drop : 특정 행이나 열 삭제

In [139]:
df.drop(columns = ['몸무게','급여']) # 열 삭제

    성명  나이
0  김민재  27
1  이강인  22
2  박찬호  50
3  차범근  70
4  추신수  43
5  손흥민  31
6  황희찬  28

In [140]:
df.drop(index = [1,3]) # 행 삭제

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
2  박찬호  50    NaN  8428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

#### dropna() : 결측치가 있는 행 또는 열 전체를 삭제

In [141]:
df.dropna(axis=0) # 기본 값, 행 삭제

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [142]:
df.dropna(axis=1) # 열 삭제

    성명  나이
0  김민재  27
1  이강인  22
2  박찬호  50
3  차범근  70
4  추신수  43
5  손흥민  31
6  황희찬  28

In [143]:
# 기본값(how = 'any') : NaN이 하나라도 있는 행 삭제
df.dropna(how='any')

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [144]:
df.dropna(axis=1, how='any')

    성명  나이
0  김민재  27
1  이강인  22
2  박찬호  50
3  차범근  70
4  추신수  43
5  손흥민  31
6  황희찬  28

In [145]:
# 모든 값이 NaN인 행만 삭제
df.dropna(how='all')

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [146]:
# 모든 값이 NaN인 열만 삭제
df.dropna(axis=1, how='all')

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [147]:
# 비결측치(non-null)가 특정개수 N개인 행 유지
df.dropna(thresh=4)

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [148]:
# 비결측치(non-null)가 특정개수 N개인 열 유지
df.dropna(axis=1, thresh=df.index.stop)

    성명  나이
0  김민재  27
1  이강인  22
2  박찬호  50
3  차범근  70
4  추신수  43
5  손흥민  31
6  황희찬  28

In [149]:
df2 = df
df2.loc[df2['성명'] == '이강인', ['나이']] = 23
df2

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
1  이강인  23   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [150]:
df

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
1  이강인  23   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [151]:
df3 = df.copy()
df3.loc[df3['성명'] == '이강인', ['나이']] = 22
df3

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [152]:
df

    성명  나이    몸무게         급여
0  김민재  27   75.0  5428000.0
1  이강인  23   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [153]:
import pandas as pd
import numpy as np

data = {
    '이름': ['철수', '영희', '민수', '지영', '준호', '수진', '하늘', '도형', '가람', '서연'],
    '몸무게': [70, np.nan, 60, 80, np.nan, 55, 90, 65, np.nan, 72],
    '급여': [5000, 6000, np.nan, 7000, 6500, np.nan, 8000, 7200, 6800, 7100],
    '나이': [25, 30, 22, 28, 35, 40, 24, 27, 33, 29]
}
ndf = pd.DataFrame(data)
ndf

   이름   몸무게      급여  나이
0  철수  70.0  5000.0  25
1  영희   NaN  6000.0  30
2  민수  60.0     NaN  22
3  지영  80.0  7000.0  28
4  준호   NaN  6500.0  35
5  수진  55.0     NaN  40
6  하늘  90.0  8000.0  24
7  도형  65.0  7200.0  27
8  가람   NaN  6800.0  33
9  서연  72.0  7100.0  29

In [154]:
# 몸무게, 급여 열 삭제
ndf.drop(columns = ['몸무게','급여'])

   이름  나이
0  철수  25
1  영희  30
2  민수  22
3  지영  28
4  준호  35
5  수진  40
6  하늘  24
7  도형  27
8  가람  33
9  서연  29

In [155]:
# 2,3번째 행 삭제
ndf.drop(index = [2,3])

   이름   몸무게      급여  나이
0  철수  70.0  5000.0  25
1  영희   NaN  6000.0  30
4  준호   NaN  6500.0  35
5  수진  55.0     NaN  40
6  하늘  90.0  8000.0  24
7  도형  65.0  7200.0  27
8  가람   NaN  6800.0  33
9  서연  72.0  7100.0  29

In [156]:
# 1~5번째 행 삭제 - 슬라이싱 불가
ndf.drop(index = range(1,6))

   이름   몸무게      급여  나이
0  철수  70.0  5000.0  25
6  하늘  90.0  8000.0  24
7  도형  65.0  7200.0  27
8  가람   NaN  6800.0  33
9  서연  72.0  7100.0  29

In [157]:
# NaN이 있는 행 삭제
ndf.dropna()

   이름   몸무게      급여  나이
0  철수  70.0  5000.0  25
3  지영  80.0  7000.0  28
6  하늘  90.0  8000.0  24
7  도형  65.0  7200.0  27
9  서연  72.0  7100.0  29

In [158]:
# NaN이 있는 열 삭제
ndf.dropna(axis=1)

   이름  나이
0  철수  25
1  영희  30
2  민수  22
3  지영  28
4  준호  35
5  수진  40
6  하늘  24
7  도형  27
8  가람  33
9  서연  29

In [159]:
# 모든 값이 NaN인 행 삭제
import pandas as pd
import numpy as np

data = {
    '이름': ['철수', '영희', '민수', '지영', '준호', '수진', '하늘', '도형', '가람', '서연', None],
    '몸무게': [70, np.nan, 60, 80, np.nan, 55, 90, 65, np.nan, 72, np.nan],
    '급여': [5000, 6000, np.nan, 7000, 6500, np.nan, 8000, 7200, 6800, 7100, np.nan],
    '나이': [25, 30, 22, 28, 35, 40, 24, 27, 33, 29, np.nan],
    '성별': [None, None, None, None, None, None, None, None, None, None, None]
}

ndf2 = pd.DataFrame(data)
ndf2.dropna(how='all')

   이름   몸무게      급여    나이    성별
0  철수  70.0  5000.0  25.0  None
1  영희   NaN  6000.0  30.0  None
2  민수  60.0     NaN  22.0  None
3  지영  80.0  7000.0  28.0  None
4  준호   NaN  6500.0  35.0  None
5  수진  55.0     NaN  40.0  None
6  하늘  90.0  8000.0  24.0  None
7  도형  65.0  7200.0  27.0  None
8  가람   NaN  6800.0  33.0  None
9  서연  72.0  7100.0  29.0  None

In [160]:
# 모든 값이 NaN인 열 삭제
ndf2.dropna(axis=1, how='all')

      이름   몸무게      급여    나이
0     철수  70.0  5000.0  25.0
1     영희   NaN  6000.0  30.0
2     민수  60.0     NaN  22.0
3     지영  80.0  7000.0  28.0
4     준호   NaN  6500.0  35.0
5     수진  55.0     NaN  40.0
6     하늘  90.0  8000.0  24.0
7     도형  65.0  7200.0  27.0
8     가람   NaN  6800.0  33.0
9     서연  72.0  7100.0  29.0
10  None   NaN     NaN   NaN

In [161]:
# 비결측치가 4개 이상인 행 유지
ndf2.dropna(thresh=4)

   이름   몸무게      급여    나이    성별
0  철수  70.0  5000.0  25.0  None
3  지영  80.0  7000.0  28.0  None
6  하늘  90.0  8000.0  24.0  None
7  도형  65.0  7200.0  27.0  None
9  서연  72.0  7100.0  29.0  None

In [162]:
# 비결측치가 8개 이상인 열 유지
ndf2.dropna(axis=1,thresh=ndf2.index.stop-3)

      이름      급여    나이
0     철수  5000.0  25.0
1     영희  6000.0  30.0
2     민수     NaN  22.0
3     지영  7000.0  28.0
4     준호  6500.0  35.0
5     수진     NaN  40.0
6     하늘  8000.0  24.0
7     도형  7200.0  27.0
8     가람  6800.0  33.0
9     서연  7100.0  29.0
10  None     NaN   NaN

### 결측치 대체
fillna()
- 결측치를 대체하는 데 사용되는 함수
- 이 함수를 통해 결측치를 특정 값, 평균, 중앙값 등으로 대체할 수 있다

In [163]:
# 몸무게의 평균값으로 결측치 대체
ndf3 = ndf2.copy()
mean_weight = ndf3['몸무게'].mean().round(2)
ndf3['몸무게'] = ndf3['몸무게'].fillna(mean_weight)
print('mean_weight :', mean_weight)
ndf3

mean_weight : 70.29

      이름    몸무게      급여    나이    성별
0     철수  70.00  5000.0  25.0  None
1     영희  70.29  6000.0  30.0  None
2     민수  60.00     NaN  22.0  None
3     지영  80.00  7000.0  28.0  None
4     준호  70.29  6500.0  35.0  None
5     수진  55.00     NaN  40.0  None
6     하늘  90.00  8000.0  24.0  None
7     도형  65.00  7200.0  27.0  None
8     가람  70.29  6800.0  33.0  None
9     서연  72.00  7100.0  29.0  None
10  None  70.29     NaN   NaN  None

In [164]:
median_salary = ndf3['급여'].median().round(1)
ndf3['급여'] = ndf3['급여'].fillna(median_salary)
print('median_salary :',median_salary)
ndf3

median_salary : 6900.0

      이름    몸무게      급여    나이    성별
0     철수  70.00  5000.0  25.0  None
1     영희  70.29  6000.0  30.0  None
2     민수  60.00  6900.0  22.0  None
3     지영  80.00  7000.0  28.0  None
4     준호  70.29  6500.0  35.0  None
5     수진  55.00  6900.0  40.0  None
6     하늘  90.00  8000.0  24.0  None
7     도형  65.00  7200.0  27.0  None
8     가람  70.29  6800.0  33.0  None
9     서연  72.00  7100.0  29.0  None
10  None  70.29  6900.0   NaN  None

### 데이터 그룹화
- .groupby() 메서드 : 특정 컬럼을 기준으로 데이터를 그룹화

In [165]:
import pandas as pd
data = [['김민재', 31, 75, 5428000],
        ['이강인', 22, 57, None],
        ['박찬호', 50, None, 8428000],
        ['차범근', 70, 80, 4428000],
        ['추신수', 43, 100, 4528000],
        ['손흥민', 31, 72, 7028000],
        ['황희찬', 28, 69, 2528000]]
df2 = pd.DataFrame(data, columns=['성명', '나이', '몸무게', '급여'])
df2

    성명  나이    몸무게         급여
0  김민재  31   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [166]:
# 중복제거 배열 반환
df2['나이'].unique()

array([31, 22, 50, 70, 43, 28])

In [167]:
# 파생컬럼 추가(값 수동 적용)
df2['종목'] = ['축구','축구','야구','축구','야구','축구','축구']
df2

    성명  나이    몸무게         급여  종목
0  김민재  31   75.0  5428000.0  축구
1  이강인  22   57.0        NaN  축구
2  박찬호  50    NaN  8428000.0  야구
3  차범근  70   80.0  4428000.0  축구
4  추신수  43  100.0  4528000.0  야구
5  손흥민  31   72.0  7028000.0  축구
6  황희찬  28   69.0  2528000.0  축구

In [168]:
df3 = df2.copy()
df3.index = ['A','B','C','D','E','F','G']
df3.loc[['B']]

    성명  나이   몸무게  급여  종목
B  이강인  22  57.0 NaN  축구

In [169]:
df4 = df3.set_index('종목')
df4

     성명  나이    몸무게         급여
종목
축구  김민재  31   75.0  5428000.0
축구  이강인  22   57.0        NaN
야구  박찬호  50    NaN  8428000.0
축구  차범근  70   80.0  4428000.0
야구  추신수  43  100.0  4528000.0
축구  손흥민  31   72.0  7028000.0
축구  황희찬  28   69.0  2528000.0

In [170]:
# 적용된 인덱스 컬럼을 돌려놓고 초기화
df5 = df4.reset_index()
df5

   종목   성명  나이    몸무게         급여
0  축구  김민재  31   75.0  5428000.0
1  축구  이강인  22   57.0        NaN
2  야구  박찬호  50    NaN  8428000.0
3  축구  차범근  70   80.0  4428000.0
4  야구  추신수  43  100.0  4528000.0
5  축구  손흥민  31   72.0  7028000.0
6  축구  황희찬  28   69.0  2528000.0

In [171]:
# 적용된 인덱스를 삭제하고 초기화
df6 = df4.reset_index(drop = True)
df6

    성명  나이    몸무게         급여
0  김민재  31   75.0  5428000.0
1  이강인  22   57.0        NaN
2  박찬호  50    NaN  8428000.0
3  차범근  70   80.0  4428000.0
4  추신수  43  100.0  4528000.0
5  손흥민  31   72.0  7028000.0
6  황희찬  28   69.0  2528000.0

In [172]:
# 나이별 값 합산
df2.groupby('나이').sum().loc[[31]]

        성명    몸무게          급여    종목
나이
31  김민재손흥민  147.0  12456000.0  축구축구

In [173]:
# 나이별 값 합산
df2_sum = df2.groupby('나이').sum().reset_index()
df2_sum[df2_sum['나이'] == 31][['성명']]

       성명
2  김민재손흥민

In [174]:
df2_hap = df2.groupby('종목')[['나이','몸무게','급여']].mean()
df2_hap

      나이    몸무게         급여
종목
야구  46.5  100.0  6478000.0
축구  36.4   70.6  4853000.0

In [175]:
df2_hap = df2.groupby('종목').mean(numeric_only=True)
int(df2_hap.loc['축구','급여'])

4853000

In [ ]:
import pandas as pd
data = {
    '제품': ['노트북', '태블릿', '스마트폰', '노트북', '스마트폰', '태블릿'],
    '지역': ['서울', '부산', '서울', '대구', '부산', '서울'],
    '판매량': [10, 5, 8, 12, 6, 4],
    '가격': [1200000, 500000, 800000, 1300000, 750000, 550000],
    '판매자번호': ['A01', 'A02', 'A01', 'A03', 'A02', 'A03']
}
df7 = pd.DataFrame(data)
df7

     제품  지역  판매량       가격 판매자번호
0   노트북  서울   10  1200000   A01
1   태블릿  부산    5   500000   A02
2  스마트폰  서울    8   800000   A01
3   노트북  대구   12  1300000   A03
4  스마트폰  부산    6   750000   A02
5   태블릿  서울    4   550000   A03

In [184]:
# 제품 별 평균판매량
df7.groupby('제품').mean(numeric_only=True)[['판매량']]

       판매량
제품
노트북   11.0
스마트폰   7.0
태블릿    4.5

In [191]:
# 지역별 총 판매량
df7.groupby('지역')[['판매량']].sum()

    판매량
지역
대구   12
부산   11
서울   22

In [218]:
# 지역별 제품별 판매량
df_prd = df7.groupby(['지역','제품'])[['판매량']].sum()

In [219]:
# 서울의 제품별 판매량
df_prd.loc[[('서울','노트북')]]

        판매량
지역 제품
서울 노트북   10

In [220]:
# index를 컬럼으로 변환
df_prd.reset_index()

   지역    제품  판매량
0  대구   노트북   12
1  부산  스마트폰    6
2  부산   태블릿    5
3  서울   노트북   10
4  서울  스마트폰    8
5  서울   태블릿    4

In [ ]:
# 판매자별 매출액 칼럼 추가
df7['매출액'] = df7['판매량'] * df7['가격']

In [222]:
df7

     제품  지역  판매량       가격 판매자번호       매출액
0   노트북  서울   10  1200000   A01  12000000
1   태블릿  부산    5   500000   A02   2500000
2  스마트폰  서울    8   800000   A01   6400000
3   노트북  대구   12  1300000   A03  15600000
4  스마트폰  부산    6   750000   A02   4500000
5   태블릿  서울    4   550000   A03   2200000

In [223]:
# 판매자별 매출총액
df7.groupby('판매자번호')[['매출액']].sum()

            매출액
판매자번호
A01    18400000
A02     7000000
A03    17800000

In [228]:
result = df7.groupby('제품').agg(
    {
        '판매량' : ['sum','mean','count'],
        '가격' : ['min','max']
    }
)
result

     판매량                   가격
     sum  mean count      min      max
제품
노트북   22  11.0     2  1200000  1300000
스마트폰  14   7.0     2   750000   800000
태블릿    9   4.5     2   500000   550000

In [227]:
sales_sum = result.loc[['노트북'],['판매량']]
sales_sum

    판매량
    sum  mean count
제품
노트북  22  11.0     2

In [229]:
sales_sumA = result.loc[['노트북'],[('판매량','mean')]]
sales_sumA

      판매량
     mean
제품
노트북  11.0